# Ultralytics YOLO11 object detection model with P2/4 - P5/32 outputs
#
# Adds a stride-4 P2 detection head for detecting very small objects
# (down to ~8×8 px vs ~16×16 px without P2).
#
# Usage:
#   model = YOLO('yolo11s-p2.yaml').load('yolo11s.pt')  # load COCO weights
#   model.train(data='...', epochs=100)
#
# Overhead vs standard yolo11: +~55% GFLOPs, +~20% inference time

# Parameters
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11 backbone (same as standard yolo11)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]           # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]          # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]   # 2
  - [-1, 1, Conv, [256, 3, 2]]          # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]   # 4
  - [-1, 1, Conv, [512, 3, 2]]          # 5-P4/16
  - [-1, 2, C3k2, [512, True]]          # 6
  - [-1, 1, Conv, [1024, 3, 2]]         # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]         # 8
  - [-1, 1, SPPF, [1024, 5]]            # 9
  - [-1, 2, C2PSA, [1024]]              # 10

# YOLO11-p2 head (adds P2/4 detection layer)
head:
  # P4 neck
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]      # 11
  - [[-1, 6], 1, Concat, [1]]                         # 12
  - [-1, 2, C3k2, [512, False]]                       # 13 (P4 neck)

  # P3 neck
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]      # 14
  - [[-1, 4], 1, Concat, [1]]                         # 15
  - [-1, 2, C3k2, [256, False]]                       # 16 (P3 neck)

  # P2 head
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]      # 17
  - [[-1, 2], 1, Concat, [1]]                         # 18  cat backbone P2
  - [-1, 2, C3k2, [128, False]]                       # 19 (P2/4-xsmall)

  # P3 head (down from P2)
  - [-1, 1, Conv, [128, 3, 2]]                        # 20
  - [[-1, 16], 1, Concat, [1]]                        # 21  cat P3 neck
  - [-1, 2, C3k2, [256, False]]                       # 22 (P3/8-small)

  # P4 head (down from P3)
  - [-1, 1, Conv, [256, 3, 2]]                        # 23
  - [[-1, 13], 1, Concat, [1]]                        # 24  cat P4 neck
  - [-1, 2, C3k2, [512, False]]                       # 25 (P4/16-medium)

  # P5 head (down from P4)
  - [-1, 1, Conv, [512, 3, 2]]                        # 26
  - [[-1, 10], 1, Concat, [1]]                        # 27  cat backbone P5
  - [-1, 2, C3k2, [1024, True]]                       # 28 (P5/32-large)

  # Detect
  - [[19, 22, 25, 28], 1, Detect, [nc]]               # 29  P2, P3, P4, P5
